[
  {
    "title": "Central Bank of Uruguay Summons to Binance Due to Its Savings Focused Cryptocurrency Products",
    "link": "https://news.bitcoin.com/central-bank-of-uruguay-summons-to-binance-due-to-its-savings-focused-cryptocurrency-products/",
    "keywords": [
      "Regulation",
      "Binance",
      "central bank of uruguay",
      "Compliance",
      "Cryptocurrency",
      "savings products",
      "Uruguay"
    ],
    "creator": ["Sergio Goschenko"],
    "video_url": null,
    "description": "The Central Bank of Uruguay has issued a summon to Binance, one of the biggest exchanges in the world, due to the series of crypto-based savings products they are offering in the country. These savings products, according to the bank, can only be made through verified banking institutions or by companies that issue equity in […]",
    "content": "The Central Bank of Uruguay has issued a summon to Binance, one of the biggest exchanges in the world, due to the series of crypto-based savings products they are offering in the country. These savings products, according to the bank, can only be made through verified banking institutions or by companies that issue equity in the national stock market. Uruguay still has no cryptocurrency-specific regulation.\r Central Bank of Uruguay to Scrutinize Binance Savings Products\r Cryptocurrency savings products are in the spotlight of several regulators of countries all over the world. The Central Bank of Uruguay has these in its sights, and it has recently issued a summon to Binance due to its product portfolio in the country. According to the institution, Binance is offering these as savings-focused alternatives, without any kind of registration or authorization from regulators.\r The institution clarified that:\r \r The call to the general public for the application of their savings can only be done through financial intermediation institutions authorized to collect deposits in the market or as an issuer registered in the stock market registry.\r \r Furthermore, the Central Bank of Uruguay called Binance to stop advertising these investment products as a savings-focused activity.\r \r Binance Answers\r The cryptocurrency exchange took no time in answering this communication, and according to Bloomberg Linea, is already having conversations about the issue with the Central Bank of Uruguay. The company has the possibility of issuing a defense and explaining its point of view regarding the investment products.\r Binance Uruguay stated that they are focused on compliance issues, appreciating regulation as the only way in which this industry can expand and reach a mainstream audience. Binance also declared:\r \r Binance reinforces that it is leading the way globally in the development of the crypto and blockchain ecosystem, working collaboratively with regulators, legislators, governments, and law enforcement authorities to ensure the most secure environment.\r \r This incident might start a debate about cryptocurrency assets, that has been separated from the issue due to the relative lack of popularity of crypto in the country when compared to others in Latam, like Venezuela, Argentina, and Colombia. In fact, there is still no cryptocurrency-specific law in Uruguay. Last year, the Central Bank of Uruguay issued a roadmap announcing crypto-related activities with the objective of getting a cryptocurrency bill passed in the future.\r What do you think about Binance and its savings-focused product portfolio in Uruguay? Tell us in the comments section below.\r",
    "pubDate": "2022-08-01 08:00:36",
    "image_url": null,
    "source_id": "bitcoin",
    "country": [
      "united states of america",
      "united kingdom",
      "india",
      "australia",
      "singapore",
      "saudi arabia",
      "canada"
    ],
    "category": ["business"],
    "language": "english"
  },
  {
    "title": "Al-Sadr's followers start protests in Iraqi Parliament",
    "link": "https://www.sentinelassam.com/international/al-sadrs-followers-start-protests-in-iraqi-parliament-605322",
    "keywords": ["International News,More"],
    "creator": ["Sentinel Digital Desk"],
    "video_url": null,
    "description": "Hundreds of followers of Shia cleric Moqtada al-Sadr started an open sit-in inside the Iraqi parliament building in central Baghdad",
    "content": "BAGHDAD: Hundreds of followers of Shia cleric Moqtada al-Sadr started an open sit-in inside the Iraqi parliament building in central Baghdad, while his political opponents called on their supporters to prepare for a counter-protest. \"The people choose the open sit-in in the parliament,\" Ibrahim al-Jaberi, Head of al-Sadr's office, wrote on Saturday on his Facebook page. Earlier on Saturday, hundreds of al-Sadr's followers broke into the Green Zone, which houses the main government headquarters, residencies of some top political leaders and some foreign embassies, and entered the Iraqi parliament building for the second time in three days. A statement by the Iraqi Health Ministry said that up to 100 people and 25 security personnel were wounded when security forces tried to prevent the demonstrators from entering the Green Zone, Xinhua news agency reported. Videos aired by TV channels and circulated on social media showed dozens of demonstrators inside the parliament building waving Iraqi flags and hailing their leader Moqtada al-Sadr. In a statement, Iraqi President Barham Salih urged everyone to keep calm and resort to dialogue to ensure the country's security and stability and consolidate its civil and social peace. In a televised speech, Prime Minister Mustafa al-Kadhimi called on everyone \"to be calm, patient, and rational, and not to be drawn into confrontation\". \"We must all cooperate to stop those who accelerate this sedition, and everyone must know that the fire of sedition will burn everyone, so the political blocs must resort to negotiation for the sake of Iraq and the Iraqis,\" he said. Later in the day, dozens of al-Sadr's followers continued to enter the Green Zone to participate in the public sit-in inside the parliament building. Meanwhile, a statement issued by al-Sadr's opponents in the Coordination Framework, an umbrella group of Shia parliamentary parties, called on \"the people who believe in the law and constitutional legitimacy to demonstrate peacefully in defence of the state, its legitimacy, and its institutions.\" For his part, Parliament Speaker Mohammed al-Halbousi announced in a statement the suspension of the parliament sessions \"until further notice,\" calling on all leaders and political blocs to gather for an urgent national meeting. In the evening, another statement by the Coordination Framework said that it was decided to postpone the date of the counter-demonstrations until further notice and to give time for dialogue and positive political solutions after some Coordination Framework leaders, tribal, and religious leaders tried to ease the tension. On Wednesday, hundreds of al-Sadr followers broke into the parliament building after the Coordination Framework, an umbrella group of Shia parliamentary parties, nominated Mohammed Shia' al-Sudani on Monday for the post of Prime Minister. The Coordination Framework became the largest alliance in the Iraqi parliament after al-Sadr ordered his followers in the Sadrist Movement, the biggest winner in the elections held on October 10, 2021, with 73 seats, to withdraw from the parliament. During the past months, the continued dispute among the Shia parties have hampered the formation of a new Iraqi government, as the parliament has been unable to elect a new President by a two-thirds majority of the 329-seat parliament under the constitution. The President, if elected, will appoint the Prime Minister nominated by the largest alliance in the parliament, the Coordination Framework, to form a new government that would rule the country for the coming four years. (IANS) Also Read: Iraq summons Turkish envoy in protest over military operations Also Watch:",
    "pubDate": "2022-08-01 07:43:48",
    "image_url": "https://assets.sentinelassam.com/h-upload/2022/08/01/500x300_370064-al-sadrs-followers-start-protests-in-iraqi-parlia.jpg",
    "source_id": "sentinel",
    "country": ["india"],
    "category": ["top"],
    "language": "english"
  },
  {
    "title": "Perpetrators of 2019 Easter Sunday attacks still engaged in politics, employed with Sri Lanka&#039;s police forces: Cardinal Ranjith",
    "link": "https://www.thehindu.com/news/international/cardinal-ranjith-says-perpetrators-of-2019-easter-sunday-attacks-still-engaged-in-politics-employed-with-sri-lanka-police-forces/article65710056.ece",
    "keywords": null,
    "creator": ["\n        PTI  \n    "],
    "video_url": null,
    "description": "Sri Lanka's Cardinal Ranjith urged the public to look at the fate of the rule of law within the country",
    "content": "The perpetrators of the heinous 2019 Easter Sunday attacks have either integrated with the country’s political fraternity or employed with the police force, Sri Lanka’s Catholic Church Archbishop Cardinal Malcolm Ranjith has said. | Photo Credit: AP The perpetrators of the heinous 2019 Easter Sunday attacks have either integrated with the country's political fraternity or employed with the police force, Sri Lanka's Catholic Church Archbishop Cardinal Malcolm Ranjith has said, as he accused the previous governments of turning a blind eye to the country’s worst act of terrorism. Cardinal Ranjith, while delivering a sermon at the festive mass held on Sunday to mark the annual feast of St. James Church in Mutuwal, urged the public to look at the fate of the rule of law within the country, news portal newsfirst.lanka reported. The Archbishop of Colombo hailed Sri Lanka a 'Dharmadweepa' (country of religion), but pointed out that it has fallen into an abyss due to people who are greedy for power and wealth betray the policies agreed upon by all, the report said. Referring to the 2019 Easter Sunday attacks, the Cardinal said:“Those who set off bombs in three churches and a few hotels in 2019 are still engaged in politics and also work as police officers. Our cry for justice has been neglected because of this. However, we as Catholics will have to keep on praying that justice would be done,” the Daily Mirror newspaper quoted him as saying. Nine suicide bombers belonging to local Islamist extremist group National Thawheed Jamaat linked to the ISIS carried out a series of devastating blasts that ripped through three churches and as many luxury hotels on April 21, 2019, killing nearly 270 people, including 11 Indians. In April, Cardinal Ranjith along with a group of kin of the Easter Sunday victims met Pope Francis in Rome in an attempt to take the case to the international community for justice as he accused the government of turning a blind eye to the country’s worst terror attack. \"We should be ashamed before the world. There is no law in the country. There is no room for justice. There is only lawlessness and the law of the powerful in the country. No matter how much we asked for an independent investigation, the law of our country did not do anything to prosecute those who have been identified as the culprits,\" he asserted. The attack stirred a political storm as the then government headed by President Maithripala Sirisena and Prime Minister Ranil Wickremesinghe were blamed for their inability to prevent the attacks despite prior intelligence being made available to the authorities. Interestingly, Wickremesinghe is currently the President . The Archbishop of Colombo added that religion is not just about coming for the Sunday Mass, but one must also live within religion. Our code of editorial values Printable version | Aug 1, 2022 12:24:16 pm | https://www.thehindu.com/news/international/cardinal-ranjith-says-perpetrators-of-2019-easter-sunday-attacks-still-engaged-in-politics-employed-with-sri-lanka-police-forces/article65710056.ece © THG PUBLISHING PVT LTD.",
    "pubDate": "2022-08-01 06:50:33",
    "image_url": null,
    "source_id": "thehindu",
    "country": ["india"],
    "category": ["top"],
    "language": "english"
  },
  {
    "title": "Will Teacher Eligibility Test (TET) be mandatory for recruitment of teachers in UP madrassas? Will there be any exceptions?",
    "link": "https://www.edexlive.com/news/2022/aug/01/willteacher-eligibility-test-tet-be-mandatory-for-recruitment-of-teachers-in-up-madrassas-exceptions-30247.html",
    "keywords": null,
    "creator": ["Edex Live"],
    "video_url": null,
    "description": "In an interview with PTI, Minister of State for Minority Welfare, Danish Azad Ansari answers all questions regarding the same ",
    "content": "The Uttar Pradesh government will make the Teacher Eligibility Test (TET) mandatory for the recruitment of teachers in madrassas of the state to provide quality education to students, as stated in a report by PTI . A proposal is being prepared for implementing it, Minister of State for Minority Welfare, Danish Azad Ansari told PTI on Sunday, July 31. He noted that the NCERT (National Council of Educational Research and Training) syllabus has been implemented to provide quality education to students in madrasas of the state. \"Since it is a scientifically designed course, it is imperative to have trained teachers to teach it better. In view of this, the government is going to make it mandatory to clear the TET for recruitment of teachers in madrasas,\" he said as stated in a report by PTI . Ansari, however, clarified that the requirement of TET will not apply to teachers of Urdu, Arabic, Farsi or Diniyat. It will be applicable only for the recruitment of teachers teaching the NCERT syllabus. Asked whether the management committees have the right to recruit teachers in madrassas and whether the government will make any changes in the law to make TET mandatory in recruitment, Ansari said, \"No, nothing like that will happen. All we are going to do is to make TET mandatory in the recruitment of teachers of modern education in madrassas.\" In 2017, the Uttar Pradesh government had approved teaching from NCERT books in Tathaniya (Classes I to V), Faukania (Classes V to VIII) and madarsas of Aaliya or higher Aaliya level (high school and above). Hakim Abdul Haque, Joint General Secretary of the Teachers Association Madaris Arabiya, said the step would lead to discrimination against a section of madrasa teachers. \"By making TET mandatory for teachers imparting modern education, there will be a practical difference of merit between teachers teaching in the same madrasa, as the educational qualification of teachers who are recruited after passing TET is more than that of those teaching Diniyat, Urdu, Arabic and Persian,\" he said, as stated in a report by PTI . \"After the new system there will be a trained teacher who will clear the recruitment examination (TET). Will the government keep both teachers in the same category? This will increase the risk of discrimination just like between permanent teachers and siksha mitra (adhoc teachers) in primary schools,\" he said. Haque demanded that special TET courses for madrassa teachers teaching diniyat, Urdu, Arabic and Persian should also be started. According to the procedure currently applicable for the recruitment of teachers in madrasas, the minimum qualification for a teacher teaching Classes I to V should be intermediate with Urdu or any equivalent certificate. Apart from this, the minimum qualification for teachers to teach in Classes V to VIII is Kamil degree or Arabic Persian or Bachelor's degree from a university with Diniyat and Fazil or Arabic or Persian for Aliya (high school and above). There are about 16,461 madrassas in the state affiliated to the madrasa board. Of these, 560 madrassas are aided by the government.",
    "pubDate": "2022-08-01 06:34:00",
    "image_url": "https://images.edexlive.com/uploads/user/imagelibrary/2022/8/1/w600X390/KAOCT2015NIE348_11-02-2016_16_6_18_08480981.jpg",
    "source_id": "edexlive",
    "country": ["india"],
    "category": ["top"],
    "language": "english"
  },
  {
    "title": "Enforcement Directorate (ED) tracks Rs 8 crore transactions from 8 frozen bank accounts",
    "link": "https://www.sentinelassam.com/national-news/enforcement-directorate-ed-tracks-rs-8-crore-transactions-from-8-frozen-bank-accounts-605256",
    "keywords": ["National News,More"],
    "creator": ["Sentinel Digital Desk"],
    "video_url": null,
    "description": "Enforcement Directorate (ED) sleuths probing the multi-crore West Bengal School Service Commission (WBSSC) recruitment irregularities scam has traced transactions",
    "content": "KOLKATA: Enforcement Directorate (ED) sleuths probing the multi-crore West Bengal School Service Commission (WBSSC) recruitment irregularities scam has traced transactions worth Rs 8 crore in eight bank accounts of Arpita Mukherjee that were frozen by the central agency at the beginning of the investigation. ED sources said that now they are trying to track the two-way money trail in these bank accounts, the first being the source from where such huge amounts were transferred to these accounts and the second being the channels where such funds were transferred in due course. \"In the remaining days of this phase of our custody of Arpita Mukherjee and Partha Chatterjee till August 3, we will grill them thoroughly on this issue. If necessary, forensic audits of these accounts will also be done,\" an agency official said. However, on Sunday afternoon while Chatterjee was taken to the ESI Hospital at Joka in the southern outskirts of Kolkata, the former Minister claimed that he did not have any money. However, he refused to make any comment when asked who is the actual owner of the huge cash and gold recovered. On July 23, the ED sleuths recovered Indian currency worth Rs 31.20 crore, foreign currencies worth around Rs 60 lakhs and gold ornaments around worth Rs 90 lakhs from Arpita Mukherjee's flat at Diamond City housing complex at Tollygunge in South Kolkata. Again on July 28, ED officials seized Rs 27.90 crore worth Indian currency and a total of 6 kg of gold in bars and ornaments from her another flat at Belgharia. ED officials have already claimed that whatever has been recovered is just a small portion of the actual financial involvement in the multi-crore scam. Agency sources said that besides checking the transaction details of these frozen bank accounts, their sleuths are simultaneously the different shale companies that are currently under their companies. Besides Arpita Mukherjee, Partha Chatterjee 's son-in-law Kalyanmoy Bhattacharya and the latter's maternal uncle Krishna Chandra Adhikari were found to be directors of some of these companies. (IANS) Also Read: Enforcement Directorate attaches property worth Rs 110 crore in KSBL case Also Watch: Guwahati Police Seizes 20,000 Bottles of Anrex Cough Syrup, 2 Held",
    "pubDate": "2022-08-01 04:19:07",
    "image_url": "https://assets.sentinelassam.com/h-upload/2022/08/01/500x300_369949-enforcement-directorate.avif",
    "source_id": "sentinel",
    "country": ["india"],
    "category": ["top"],
    "language": "english"
  },
  {
    "title": "'Trinamool workers worried after Mamata dumped Partha' Says BJP",
    "link": "https://www.sentinelassam.com/national-news/trinamool-workers-worried-after-mamata-dumped-partha-says-bjp-605255",
    "keywords": ["National News,More"],
    "creator": ["Sentinel Digital Desk"],
    "video_url": null,
    "description": "The BJP on Sunday claimed that the Trinamool Congress workers “involved in scams and other illegal activities are worried” after West Bengal Chief Minister Mamata Banerjee “dumped” Partha Chatterjee.",
    "content": "NEW DELHI: The BJP on Sunday claimed that the Trinamool Congress workers \"involved in scams and other illegal activities are worried\" after West Bengal Chief Minister Mamata Banerjee \"dumped\" Partha Chatterjee. West Bengal BJP co-incharge Amit Malviya tweeted, \"After Mamata Banerjee dumped Partha, her close confidant, every criminal in the Trinamool , from minister to ordinary worker, who are involved in scams, rapes and murders, are worried. They acted on the assurance that Mamata would protect them but now they feel slighted. Law is supreme.\" The ED has arrested Chatterjee in the SSC scam and recovered around Rs 50 crore, several kilograms of gold, and documents of several properties from his close associate Arpita Mukherjee. On Thursday, Chatterjee was removed from the state cabinet and the party. Earlier Malviya had asked why West Bengal minister of state for education Paresh Adhikari has not been sacked after an FIR was filed against him. \"The rot of SSC Scam is so deep that the Calcutta High Court had to cancel illegal appointment of Ankita Adhikari, daughter of Paresh Adhikari,... Why has he not been sacked? Will Mamata Banerjee explain,\" he had said. \"It is abundantly clear that Mamata Banerjee is feeling the heat. Obscene amount of cash recovered has exposed the dark underbelly of the Trinamool government. Getting rid of Partha Chatterjee is an admission that the noose is tightening and it is just a matter of time before it ropes in Mamata,\" Malviya had added. (IANS) Also Read: WBSSC Scam: Partha Chatterjee removed from all three ministerial posts Also Watch: Annada Damre, a Young Maharashtrian girl asked CM Eknath Shinde if he could take her to Guwahati",
    "pubDate": "2022-08-01 04:14:42",
    "image_url": "https://assets.sentinelassam.com/h-upload/2022/08/01/500x300_369948-mamata.avif",
    "source_id": "sentinel",
    "country": ["india"],
    "category": ["top"],
    "language": "english"
  },
  {
    "title": "Arjun Kanungo to marry Carla Dennis",
    "link": "https://www.tribuneindia.com/news/lifestyle/arjun-kanungo-to-marry-carla-dennis-417672",
    "keywords": null,
    "creator": null,
    "video_url": null,
    "description": "Singing sensation Arjun Kanungo is all set to tie the knot with long-time fianceacute;e Carla Dennis this August. It will be a three-day affair in Mumbai in the presence of family and friends. This includes mehndi ceremony on August 9, wedding ceremony on August 10 and a reception on August 11. The wedding is believed to take place as per Hindu traditions, where Carla will pair her bridal outfit with her mother-in-law's jewellery. Arjun says, \"Carla understands Indian weddings and has, in fact, taken over the prep completely. She picked the venues and hired a wedding planner. She also selected my outfits for the wedding. Even though her family is not from India, they are excitedly working on their Indian wedding attire and prep.\" Arjun and Carla also plan to hold a white wedding next year. Arjun says, \"We will be hosting this in April 2023 in the UK. This is for Carla and her near and dear ones.\" — TmS",
    "content": "Singing sensation Arjun Kanungo is all set to tie the knot with long-time fiancée Carla Dennis this August. It will be a three-day affair in Mumbai in the presence of family and friends. This includes mehndi ceremony on August 9, wedding ceremony on August 10 and a reception on August 11. The wedding is believed to take place as per Hindu traditions, where Carla will pair her bridal outfit with her mother-in-law’s jewellery. Arjun says, “Carla understands Indian weddings and has, in fact, taken over the prep completely. She picked the venues and hired a wedding planner. She also selected my outfits for the wedding. Even though her family is not from India, they are excitedly working on their Indian wedding attire and prep.” Arjun and Carla also plan to hold a white wedding next year. Arjun says, “We will be hosting this in April 2023 in the UK. This is for Carla and her near and dear ones.” — TmS",
    "pubDate": "2022-08-01 03:38:00",
    "image_url": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/8/2022_8$largeimg_908711769.JPG",
    "source_id": "tribuneindia",
    "country": ["india"],
    "category": ["entertainment"],
    "language": "english"
  },
  {
    "title": "Nitish Kumar allies question liquor ban, RJD targets BJP for weakening JD(U)",
    "link": "https://www.sentinelassam.com/national-news/nitish-kumar-allies-question-liquor-ban-rjd-targets-bjp-for-weakening-jdu-605251",
    "keywords": ["National News,More"],
    "creator": ["Sentinel Digital Desk"],
    "video_url": null,
    "description": "Liquor ban is one of the ambitious programmes of Chief Minister Nitish Kumar with the mission to target the women voters. However, several hooch tragedies in the state",
    "content": "PATNA: Liquor ban is one of the ambitious programmes of Chief Minister Nitish Kumar with the mission to target the women voters. However, several hooch tragedies in the state seem to have made things difficult for the ruling party. The state government has never given the official death figures in the hooch tragedies, but sources say that it has reached above four figure mark. This is the reason why not only the opposition but its alliance partners are also questioning the ill-implementation of the law. In many public events, Nitish Kumar said that the decision of liquor ban was taken after several complaints by women whose husbands were involved in domestic violence in drunken state. The liquor ban was imposed in Bihar in April 2016 and its misuse was also visible on ground soon after. The alliance partners BJP and Hindustani Awam Morcha (HAM) have demanded a review and amendment of the law, however, for Nitish Kumar it has turned into a question of prestige. RJD leader and state spokesperson Chitranjan Gagan blamed the BJP for the failure of liquor ban in Bihar. \"If we remember, when the liquor prohibition Act came into effect in Bihar, Mahagathbandhan was ruling the state and Nitish Kumar was the chief minister. We have supported him in the preparation and implementation of its execution on the ground. It was running smoothly when RJD was in power. Then Nitish Kumar shifted from the alliance and joined the BJP to form the government in Bihar,\" Gagan said. \"The situation started to change from there on and hooch tragedies started taking place in Bihar. BJP has real 'Chal, Charitra and Chehra' to stay in the alliance to make its partner weak like what the termites do to the wood. Making an alliance with the BJP has a great consequences. See what has happened to the Shiv Sena and Shiromani Akali Dal (SAD). Nitish Kumar came late in 1996 with the BJP while the Shiv Sena and SAD are the oldest allies but what happened to them. They are completely destroyed. BJP has the policy to make alliances with regional political parties and make them weak while staying in power,\" Gagan said. \"Now, it is visible on ground when the BJP did the 'Prawas programme' in 200 Assembly constituencies in Bihar. Its state co-in-charge Harish Dwivedi also said that his party will do the same in all 243 Assembly seats. The message is loud and clear for the JD(U) that the BJP is not taking care of JD(U) and wants to go alone in the 2024 Lok Sabha election. The result of Lok Sabha election will further decide its future planning for the 2025 assembly election,\" Gagan said. Countering the allegation of the RJD, Arvind Kumar Singh, the state spokesperson of the BJP said, \"The decision of liquor ban was unanimous by all political parties in the interest of common people though the RJD was internally not satisfied with it. When we came into power with JD(U), we continued it and were not challenged at any point. The allegation of RJD was baseless on BJP.\" \"As far as weakening alliance partners is concerned, we have a long history of running the government with alliance partners. Our former Prime Minister Atal Bihari Bajpayee successfully ran the government with 26 alliance partners. So we take every one forward,\" Singh said. Reacting on the 'Prawas Programme', Singh said: \"We did the Prawas Programme in 200 Assembly constituencies to bring the work done by the NDA government at Centre and state before the public. As far as policy-making is concerned, our party cannot reveal the policy with alliance parties and as they do with us. We are running the government under a common minimum programme.\" Jitan Ram Manjhi, former CM, claimed that liquor ban brought corruption among the police in Bihar. Manjhi, the 78 year old veteran Dalit leader, further said that his father and mother also drink \"Lal Pani\" (Liquor) but he never touched liquor in his life. \"In a state like Bihar, awareness among the people is more important than prohibition. The state government has banned liquor in Bihar. In the shade of liquor ban, the police personnel used to frame poor people and earn crores. It has turned into a money making tool for the police personnel in Bihar. It has encouraged corruption in the police department,\" Manjhi said. (IANS) Also Read: Transfer-posting industry booming in Bihar: RJD Also Watch: Guwahati Police Seizes 20,000 Bottles of Anrex Cough Syrup, 2 Held",
    "pubDate": "2022-08-01 03:28:25",
    "image_url": "https://assets.sentinelassam.com/h-upload/2022/08/01/500x300_369941-nitish-kumar.jpg",
    "source_id": "sentinel",
    "country": ["india"],
    "category": ["top"],
    "language": "english"
  },
  {
    "title": "Grant civil, criminal immunity for directors of Delhi Gymkhana Club: Centre to NCLT",
    "link": "https://www.sentinelassam.com/national-news/grant-civil-criminal-immunity-for-directors-of-delhi-gymkhana-club-centre-to-nclt-605249",
    "keywords": ["National News,More"],
    "creator": ["Sentinel Digital Desk"],
    "video_url": null,
    "description": "The Central government has moved the National Company Law Tribunal seeking civil and criminal immunity for all six directors, appointed by it in April",
    "content": "NEW DELHI: The Central government has moved the National Company Law Tribunal seeking civil and criminal immunity for all six directors, appointed by it in April to manage the affairs of the Delhi Gymkhana Club (DGC). The ministry of corporate affairs, in an application, said, \"The newly appointed directors are under the threat of being exposed to past liabilities incurred by the Respondent No. I Company (DGC) owing to actions taken/ not taken by the erstwhile management.\" It added that the directors may become subject to disability or disqualification under law, including but not limited to Sections 164 and 167 of the Companies Act. \"Moreover, various procedures under the Companies Act, 2013 or rules made there under may be required to be complied with which would invariably delay and defeat the swift action that is required to be taken by the said directors,\" added the application. The government urged the tribunal to declare that the newly appointed directors \"should not in discharge of their collective or individual responsibilities, be made subject to any civil and/criminal and /or punitive action, direct or vicarious or of any nature whatsoever, by the state or Central government agencies whether in exercise of their statutory, quasi-judicial, or regulatory powers or otherwise without the prior leave of this tribunal or Central government.\" Citing orders of the tribunal on the embattled Infrastructure Leasing & Financial Services Ltd (IL&FS), the government called for immunity of the six directors for the \"past wrongs\" allegedly committed by previous committees. The application contended the tribunal had shielded new board members of IL&FS against criminal and civil action. Speaking with IANS, Atul Dev, member of the last elected general committee of DGC, said: \"The government has cited IL&FS order seeking immunity, but IL&FS and the club are distinct matters. They can't be compared.\" The government urged the tribunal to pass a direction that the newly appointed directors \"will not be subject to any disability or disqualification under any law, regulations or guideline (including Sections 164 and 167 of the Companies Act, 2013) or from any liability, financial or otherwise arising out of or in connection with their directorship in the Respondent No. 1 Company\". Against the backdrop of immunity from the past liabilities of the DGC, the government contended that it would help the directors in taking corrective measures in good faith and bona fide basis for the purpose of effective independent functioning, individually and collectively, and for the effective implementation of the tribunal's order. The directors were tasked to manage the affairs of the company in accordance with the memorandum and Articles of Association and the Companies Act, 2013. In the April 1 order, the tribunal had noted that there were allegations of financial irregularities as well as violation of membership rules at the prestigious club. (IANS) Also Read: NCLT, NCLAT cannot sit in appeal over the commercial wisdom of CoC: SC Also Watch: Annada Damre, a Young Maharashtrian girl asked CM Eknath Shinde if he could take her to Guwahati",
    "pubDate": "2022-08-01 03:21:37",
    "image_url": "https://assets.sentinelassam.com/h-upload/2022/08/01/500x300_369939-nclt.jpg",
    "source_id": "sentinel",
    "country": ["india"],
    "category": ["top"],
    "language": "english"
  }
]
